package com.app._19_12_2024;

public class T2 {
    /**
     * 11. Напишите метод, который принимает массив чисел и возвращает их сумму.
     */
    public static int sumArray(int[] numbers) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 12. Напишите метод, который принимает два числа и возводит первое в степень второго.
     */
    public static double power(int base, int exponent) {
        // TODO: реализовать метод
        return 0.0;
    }

    /**
     * 13. Напишите метод, который проверяет, является ли число простым.
     */
    public static boolean isPrime(int number) {
        // TODO: реализовать метод
        return false;
    }

    /**
     * 14. Напишите метод, который принимает два числа и возвращает их наибольший общий делитель (НОД).
     */
    public static int gcd(int a, int b) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 15. Напишите метод, который принимает массив чисел и возвращает его максимальный элемент.
     */
    public static int maxInArray(int[] numbers) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 16. Напишите метод, который принимает массив чисел и возвращает его минимальный элемент.
     */
    public static int minInArray(int[] numbers) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 17. Напишите метод, который проверяет, является ли число палиндромом
     * (одинаково читается слева направо и справа налево).
     */
    public static boolean isPalindrome(int number) {
        // TODO: реализовать метод
        return false;
    }

    /**
     * 18. Напишите метод, который возвращает n-ое число Фибоначчи.
     */
    public static int fibonacci(int n) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 19. Напишите метод, который принимает массив чисел и сортирует его по возрастанию.
     */
    public static int[] sortArray(int[] numbers) {
        // TODO: реализовать метод
        return new int[0];
    }

    /**
     * 20. Напишите метод, который принимает два числа и возвращает их наименьшее общее кратное (НОК).
     */
    public static int lcm(int a, int b) {
        // TODO: реализовать метод
        return 0;
    }

    public static void main(String[] args) {
        // Пример вызовов методов (после их реализации)
        // System.out.println(add(3, 5));
    }
}
